docs/dataTable.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2021-05-04 Tue 18:35 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>data.table Examples</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Mitch Richling" />
<meta name="description" content="data.table features.@EOL"
 />
<meta name="keywords" content="package cran data.table R" />











</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="https://richmit.github.io/ex-R/"> UP </a>
 |
 <a accesskey="H" href="https://www.mitchr.me/"> HOME </a>
</div><div id="content">
<h1 class="title">data.table Examples</h1>
<table border="2 solid #ccc" cellspacing="0" cellpadding="6" rules="groups" frame="hsides" align="center">


<colgroup>
<col  class="org-right" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-right"><b>Author:</b></td>
<td class="org-left"><i>Mitch Richling</i></td>
</tr>

<tr>
<td class="org-right"><b>Updated:</b></td>
<td class="org-left"><i>2021-05-04 18:33:26</i></td>
</tr>
</tbody>
</table>
<p align="center">
Copyright 2020-2021 Mitch Richling. All rights reserved.
</p>

<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orge60da19">1. Metadata</a></li>
<li><a href="#org0b64a75">2. Load the library</a></li>
<li><a href="#org19a48b5">3. Example Data</a></li>
<li><a href="#org6b3a9cc">4. data.frame to data.table</a></li>
<li><a href="#org5fde655">5. Indexing</a></li>
<li><a href="#org6c89084">6. Indexing: First Argument</a>
<ul>
<li><a href="#org19374ce">6.1. An integer (row number)</a></li>
<li><a href="#org4b4c5ec">6.2. Numeric Range (row numbers)</a></li>
<li><a href="#org5fb6aee">6.3. Boolean (select matching rows)</a></li>
<li><a href="#orgcd4f742">6.4. Strings</a>
<ul>
<li><a href="#org94fa3a6">6.4.1. Key column Indexing</a></li>
<li><a href="#orged130e6">6.4.2. Key column need not be unique</a></li>
<li><a href="#org48e27ec">6.4.3. Get just one match</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org9dab997">7. Indexing: The Second Argument</a>
<ul>
<li><a href="#org1577819">7.1. The data.frame way</a></li>
<li><a href="#org9ef3652">7.2. Column Name Expression</a></li>
<li><a href="#org591729d">7.3. Assignment</a></li>
<li><a href="#org7d6b97f">7.4. List</a></li>
<li><a href="#org0066242">7.5. Aggregation</a></li>
</ul>
</li>
<li><a href="#orgdf3c624">8. Indexing: The third argument</a>
<ul>
<li><a href="#org42fe05f">8.1. Aggregation by factors</a></li>
<li><a href="#orgd758a87">8.2. Aggregation and new columns</a></li>
</ul>
</li>
<li><a href="#org8020187">9. Joining</a></li>
<li><a href="#org1ad6570">10. Reading data from the outside world</a>
<ul>
<li><a href="#orgb2e92fb">10.1. Read a CSV or TSV file</a></li>
<li><a href="#org0874952">10.2. Compressed files are decompressed automatically</a></li>
<li><a href="#orgfc90502">10.3. Reading data from a URL</a></li>
<li><a href="#org69f0fef">10.4. Read output from a command (in this case compressing with gunzip and filtering with awk)</a></li>
<li><a href="#org9da1994">10.5. Read a colon (:) separated file with extra whitespace and no column names</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-orge60da19" class="outline-2">
<h2 id="orge60da19"><span class="section-number-2">1</span> Metadata</h2>
<div class="outline-text-2" id="text-1">
<p>
The home for this HTML file is: <a href="https://richmit.github.io/ex-R/dataTable.html">https://richmit.github.io/ex-R/dataTable.html</a>
</p>

<p>
Files related to this document may be found on github: <a href="https://github.com/richmit/ex-R">https://github.com/richmit/ex-R</a>
</p>

<p>
Directory contents:
</p>
<table border="0" cellspacing="0" cellpadding="6" rules="none" frame="none" align="center">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left"><code>src</code></td>
<td class="org-left">-</td>
<td class="org-left">The org-mode file that generated this HTML document</td>
</tr>

<tr>
<td class="org-left"><code>docs</code></td>
<td class="org-left">-</td>
<td class="org-left">This html document</td>
</tr>

<tr>
<td class="org-left"><code>data</code></td>
<td class="org-left">-</td>
<td class="org-left">Data files</td>
</tr>

<tr>
<td class="org-left"><code>tangled</code></td>
<td class="org-left">-</td>
<td class="org-left">Tangled R code from this document</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-org0b64a75" class="outline-2">
<h2 id="org0b64a75"><span class="section-number-2">2</span> Load the library</h2>
<div class="outline-text-2" id="text-2">
<div class="org-src-container">
<pre class="src src-R"><span style="color: #8470ff; font-weight: bold;">library</span>(data.table)
</pre>
</div>
</div>
</div>

<div id="outline-container-org19a48b5" class="outline-2">
<h2 id="org19a48b5"><span class="section-number-2">3</span> Example Data</h2>
<div class="outline-text-2" id="text-3">
<div class="org-src-container">
<pre class="src src-R">mtcars
</pre>
</div>

<div class="org-src-container">
<pre class="src src-text">                     mpg cyl  disp  hp drat    wt  qsec vs am gear carb
Mazda RX4           21.0   6 160.0 110 3.90 2.620 16.46  0  1    4    4
Mazda RX4 Wag       21.0   6 160.0 110 3.90 2.875 17.02  0  1    4    4
Datsun 710          22.8   4 108.0  93 3.85 2.320 18.61  1  1    4    1
Hornet 4 Drive      21.4   6 258.0 110 3.08 3.215 19.44  1  0    3    1
Hornet Sportabout   18.7   8 360.0 175 3.15 3.440 17.02  0  0    3    2
Valiant             18.1   6 225.0 105 2.76 3.460 20.22  1  0    3    1
Duster 360          14.3   8 360.0 245 3.21 3.570 15.84  0  0    3    4
Merc 240D           24.4   4 146.7  62 3.69 3.190 20.00  1  0    4    2
Merc 230            22.8   4 140.8  95 3.92 3.150 22.90  1  0    4    2
Merc 280            19.2   6 167.6 123 3.92 3.440 18.30  1  0    4    4
Merc 280C           17.8   6 167.6 123 3.92 3.440 18.90  1  0    4    4
Merc 450SE          16.4   8 275.8 180 3.07 4.070 17.40  0  0    3    3
Merc 450SL          17.3   8 275.8 180 3.07 3.730 17.60  0  0    3    3
Merc 450SLC         15.2   8 275.8 180 3.07 3.780 18.00  0  0    3    3
Cadillac Fleetwood  10.4   8 472.0 205 2.93 5.250 17.98  0  0    3    4
Lincoln Continental 10.4   8 460.0 215 3.00 5.424 17.82  0  0    3    4
Chrysler Imperial   14.7   8 440.0 230 3.23 5.345 17.42  0  0    3    4
Fiat 128            32.4   4  78.7  66 4.08 2.200 19.47  1  1    4    1
Honda Civic         30.4   4  75.7  52 4.93 1.615 18.52  1  1    4    2
Toyota Corolla      33.9   4  71.1  65 4.22 1.835 19.90  1  1    4    1
Toyota Corona       21.5   4 120.1  97 3.70 2.465 20.01  1  0    3    1
Dodge Challenger    15.5   8 318.0 150 2.76 3.520 16.87  0  0    3    2
AMC Javelin         15.2   8 304.0 150 3.15 3.435 17.30  0  0    3    2
Camaro Z28          13.3   8 350.0 245 3.73 3.840 15.41  0  0    3    4
Pontiac Firebird    19.2   8 400.0 175 3.08 3.845 17.05  0  0    3    2
Fiat X1-9           27.3   4  79.0  66 4.08 1.935 18.90  1  1    4    1
Porsche 914-2       26.0   4 120.3  91 4.43 2.140 16.70  0  1    5    2
Lotus Europa        30.4   4  95.1 113 3.77 1.513 16.90  1  1    5    2
Ford Pantera L      15.8   8 351.0 264 4.22 3.170 14.50  0  1    5    4
Ferrari Dino        19.7   6 145.0 175 3.62 2.770 15.50  0  1    5    6
Maserati Bora       15.0   8 301.0 335 3.54 3.570 14.60  0  1    5    8
Volvo 142E          21.4   4 121.0 109 4.11 2.780 18.60  1  1    4    2
</pre>
</div>
</div>
</div>
