src/dataTable.org
* data.frame to data.table

One can directly coerce a data.frame into a data.table; however, row names will be lost.  We can do something like this to keep them:

#+BEGIN_SRC R :session :results output verbatim :exports both :tangle "../tangled/dataTable.R" :wrap "src text :eval never :tangle no"
mtcarsDT <- data.table(mtcars, names=rownames(mtcars))
mtcarsDT
#+END_SRC

#+RESULTS:
#+begin_src text :eval never :tangle no
     mpg cyl  disp  hp drat    wt  qsec vs am gear carb               names
 1: 21.0   6 160.0 110 3.90 2.620 16.46  0  1    4    4           Mazda RX4
 2: 21.0   6 160.0 110 3.90 2.875 17.02  0  1    4    4       Mazda RX4 Wag
 3: 22.8   4 108.0  93 3.85 2.320 18.61  1  1    4    1          Datsun 710
 4: 21.4   6 258.0 110 3.08 3.215 19.44  1  0    3    1      Hornet 4 Drive
 5: 18.7   8 360.0 175 3.15 3.440 17.02  0  0    3    2   Hornet Sportabout
 6: 18.1   6 225.0 105 2.76 3.460 20.22  1  0    3    1             Valiant
 7: 14.3   8 360.0 245 3.21 3.570 15.84  0  0    3    4          Duster 360
 8: 24.4   4 146.7  62 3.69 3.190 20.00  1  0    4    2           Merc 240D
 9: 22.8   4 140.8  95 3.92 3.150 22.90  1  0    4    2            Merc 230
10: 19.2   6 167.6 123 3.92 3.440 18.30  1  0    4    4            Merc 280
11: 17.8   6 167.6 123 3.92 3.440 18.90  1  0    4    4           Merc 280C
12: 16.4   8 275.8 180 3.07 4.070 17.40  0  0    3    3          Merc 450SE
13: 17.3   8 275.8 180 3.07 3.730 17.60  0  0    3    3          Merc 450SL
14: 15.2   8 275.8 180 3.07 3.780 18.00  0  0    3    3         Merc 450SLC
15: 10.4   8 472.0 205 2.93 5.250 17.98  0  0    3    4  Cadillac Fleetwood
16: 10.4   8 460.0 215 3.00 5.424 17.82  0  0    3    4 Lincoln Continental
17: 14.7   8 440.0 230 3.23 5.345 17.42  0  0    3    4   Chrysler Imperial
18: 32.4   4  78.7  66 4.08 2.200 19.47  1  1    4    1            Fiat 128
19: 30.4   4  75.7  52 4.93 1.615 18.52  1  1    4    2         Honda Civic
20: 33.9   4  71.1  65 4.22 1.835 19.90  1  1    4    1      Toyota Corolla
21: 21.5   4 120.1  97 3.70 2.465 20.01  1  0    3    1       Toyota Corona
22: 15.5   8 318.0 150 2.76 3.520 16.87  0  0    3    2    Dodge Challenger
23: 15.2   8 304.0 150 3.15 3.435 17.30  0  0    3    2         AMC Javelin
24: 13.3   8 350.0 245 3.73 3.840 15.41  0  0    3    4          Camaro Z28
25: 19.2   8 400.0 175 3.08 3.845 17.05  0  0    3    2    Pontiac Firebird
26: 27.3   4  79.0  66 4.08 1.935 18.90  1  1    4    1           Fiat X1-9
27: 26.0   4 120.3  91 4.43 2.140 16.70  0  1    5    2       Porsche 914-2
28: 30.4   4  95.1 113 3.77 1.513 16.90  1  1    5    2        Lotus Europa
29: 15.8   8 351.0 264 4.22 3.170 14.50  0  1    5    4      Ford Pantera L
30: 19.7   6 145.0 175 3.62 2.770 15.50  0  1    5    6        Ferrari Dino
31: 15.0   8 301.0 335 3.54 3.570 14.60  0  1    5    8       Maserati Bora
32: 21.4   4 121.0 109 4.11 2.780 18.60  1  1    4    2          Volvo 142E
     mpg cyl  disp  hp drat    wt  qsec vs am gear carb               names
#+end_src

* Indexing

data.tables are indexed with three arguments (as in: =a[1,2,3]=).

* Indexing: First Argument

In general the first index argument is used to select rows.

** An integer (row number)

#+BEGIN_SRC R :session :results output verbatim :exports both :tangle "../tangled/dataTable.R" :wrap "src text :eval never :tangle no"
mtcarsDT[2,]
#+END_SRC

#+RESULTS:
#+begin_src text :eval never :tangle no
   mpg cyl disp  hp drat    wt  qsec vs am gear carb         names
1:  21   6  160 110  3.9 2.875 17.02  0  1    4    4 Mazda RX4 Wag
#+end_src

Note that when we only have one index, we don't need the comma!!

#+BEGIN_SRC R :session :results output verbatim :exports both :tangle "../tangled/dataTable.R" :wrap "src text :eval never :tangle no"
mtcarsDT[2]
#+END_SRC

#+RESULTS:
#+begin_src text :eval never :tangle no
   mpg cyl disp  hp drat    wt  qsec vs am gear carb         names
1:  21   6  160 110  3.9 2.875 17.02  0  1    4    4 Mazda RX4 Wag
#+end_src

** Numeric Range (row numbers)

Get rows 2 through 5

#+BEGIN_SRC R :session :results output verbatim :exports both :tangle "../tangled/dataTable.R" :wrap "src text :eval never :tangle no"
mtcarsDT[2:5]
#+END_SRC

#+RESULTS:
#+begin_src text :eval never :tangle no
    mpg cyl disp  hp drat    wt  qsec vs am gear carb             names
1: 21.0   6  160 110 3.90 2.875 17.02  0  1    4    4     Mazda RX4 Wag
2: 22.8   4  108  93 3.85 2.320 18.61  1  1    4    1        Datsun 710
3: 21.4   6  258 110 3.08 3.215 19.44  1  0    3    1    Hornet 4 Drive
4: 18.7   8  360 175 3.15 3.440 17.02  0  0    3    2 Hornet Sportabout
#+end_src

** Boolean (select matching rows)

Get rows where cyl is equal to 6

#+BEGIN_SRC R :session :results output verbatim :exports both :tangle "../tangled/dataTable.R" :wrap "src text :eval never :tangle no"
mtcarsDT[cyl==6]
#+END_SRC

#+RESULTS:
#+begin_src text :eval never :tangle no
    mpg cyl  disp  hp drat    wt  qsec vs am gear carb          names
1: 21.0   6 160.0 110 3.90 2.620 16.46  0  1    4    4      Mazda RX4
2: 21.0   6 160.0 110 3.90 2.875 17.02  0  1    4    4  Mazda RX4 Wag
3: 21.4   6 258.0 110 3.08 3.215 19.44  1  0    3    1 Hornet 4 Drive
4: 18.1   6 225.0 105 2.76 3.460 20.22  1  0    3    1        Valiant
5: 19.2   6 167.6 123 3.92 3.440 18.30  1  0    4    4       Merc 280
6: 17.8   6 167.6 123 3.92 3.440 18.90  1  0    4    4      Merc 280C
7: 19.7   6 145.0 175 3.62 2.770 15.50  0  1    5    6   Ferrari Dino
#+end_src

** Strings
*** Key column Indexing

If you have a "key column" set, you can index with strings -- note that this will change the order of the table to store on the key.

#+BEGIN_SRC R :session :results output verbatim :exports both :tangle "../tangled/dataTable.R" :wrap "src text :eval never :tangle no"
setkey(mtcarsDT,names)
mtcarsDT["Valiant"]
#+END_SRC

#+RESULTS:
#+begin_src text :eval never :tangle no
    mpg cyl disp  hp drat   wt  qsec vs am gear carb   names
1: 18.1   6  225 105 2.76 3.46 20.22  1  0    3    1 Valiant
#+end_src

*** Key column need not be unique

#+BEGIN_SRC R :session :results output verbatim :exports both :tangle "../tangled/dataTable.R" :wrap "src text :eval never :tangle no"
mtcarsDT$cylNames <- paste("cyl", mtcarsDT$cyl, sep='=')
setkey(mtcarsDT,cylNames)
mtcarsDT["cyl=6"]
#+END_SRC

#+RESULTS:
#+begin_src text :eval never :tangle no
    mpg cyl  disp  hp drat    wt  qsec vs am gear carb          names cylNames
1: 19.7   6 145.0 175 3.62 2.770 15.50  0  1    5    6   Ferrari Dino    cyl=6
2: 21.4   6 258.0 110 3.08 3.215 19.44  1  0    3    1 Hornet 4 Drive    cyl=6
3: 21.0   6 160.0 110 3.90 2.620 16.46  0  1    4    4      Mazda RX4    cyl=6
4: 21.0   6 160.0 110 3.90 2.875 17.02  0  1    4    4  Mazda RX4 Wag    cyl=6
5: 19.2   6 167.6 123 3.92 3.440 18.30  1  0    4    4       Merc 280    cyl=6
6: 17.8   6 167.6 123 3.92 3.440 18.90  1  0    4    4      Merc 280C    cyl=6
7: 18.1   6 225.0 105 2.76 3.460 20.22  1  0    3    1        Valiant    cyl=6
#+end_src

