docs/dataTable.html

<div id="outline-container-org48e27ec" class="outline-4">
<h4 id="org48e27ec"><span class="section-number-4">6.4.3</span> Get just one match</h4>
<div class="outline-text-4" id="text-6-4-3">
<div class="org-src-container">
<pre class="src src-R">mtcarsDT[<span style="color: #fa8072;">"cyl=6"</span>,mult=<span style="color: #fa8072;">"first"</span>]
</pre>
</div>

<div class="org-src-container">
<pre class="src src-text">    mpg cyl disp  hp drat   wt qsec vs am gear carb        names cylNames
1: 19.7   6  145 175 3.62 2.77 15.5  0  1    5    6 Ferrari Dino    cyl=6
</pre>
</div>
</div>
</div>
</div>
</div>

<div id="outline-container-org9dab997" class="outline-2">
<h2 id="org9dab997"><span class="section-number-2">7</span> Indexing: The Second Argument</h2>
<div class="outline-text-2" id="text-7">
</div>
<div id="outline-container-org1577819" class="outline-3">
<h3 id="org1577819"><span class="section-number-3">7.1</span> The data.frame way</h3>
<div class="outline-text-3" id="text-7-1">
<p>
Grab column "cyl" the data.frame way. 
</p>

<div class="org-src-container">
<pre class="src src-R">mtcarsDT$cyl
</pre>
</div>

<div class="org-src-container">
<pre class="src src-text">[1] 4 4 4 4 4 4 4 4 4 4 4 6 6 6 6 6 6 6 8 8 8 8 8 8 8 8 8 8 8 8 8 8
</pre>
</div>
</div>
</div>

<div id="outline-container-org9ef3652" class="outline-3">
<h3 id="org9ef3652"><span class="section-number-3">7.2</span> Column Name Expression</h3>
<div class="outline-text-3" id="text-7-2">
<p>
The second index of a data.table is an expression on the rows selected by the first index.  
</p>

<p>
Here we just have an expresion with a single column name.  As this will evaluate to the cyl column, that is what is returned.
</p>

<div class="org-src-container">
<pre class="src src-R">mtcarsDT[,cyl]
</pre>
</div>

<div class="org-src-container">
<pre class="src src-text">[1] 4 4 4 4 4 4 4 4 4 4 4 6 6 6 6 6 6 6 8 8 8 8 8 8 8 8 8 8 8 8 8 8
</pre>
</div>

<p>
Here we just have an arithmatic expresion in two column names.
</p>

<div class="org-src-container">
<pre class="src src-R">mtcarsDT[,disp/cyl]
</pre>
</div>

<div class="org-src-container">
<pre class="src src-text"> [1] 27.00000 19.67500 19.75000 18.92500 23.77500 35.20000 36.67500 30.07500 17.77500 30.02500 30.25000 24.16667 43.00000 26.66667 26.66667 27.93333 27.93333 37.50000 38.00000 59.00000 43.75000
[22] 55.00000 39.75000 45.00000 43.87500 45.00000 57.50000 37.62500 34.47500 34.47500 34.47500 50.00000
</pre>
</div>
</div>
</div>

<div id="outline-container-org591729d" class="outline-3">
<h3 id="org591729d"><span class="section-number-3">7.3</span> Assignment</h3>
<div class="outline-text-3" id="text-7-3">
<p>
We can create new columns by assigning an expression in the second argument to a new name.
</p>

<div class="org-src-container">
<pre class="src src-R">mtcarsDT[,cylTimesGear:=cyl*gear]
mtcarsDT
</pre>
</div>

<div class="org-src-container">
<pre class="src src-text">     mpg cyl  disp  hp drat    wt  qsec vs am gear carb               names cylNames cylTimesGear
 1: 22.8   4 108.0  93 3.85 2.320 18.61  1  1    4    1          Datsun 710    cyl=4           16
 2: 32.4   4  78.7  66 4.08 2.200 19.47  1  1    4    1            Fiat 128    cyl=4           16
 3: 27.3   4  79.0  66 4.08 1.935 18.90  1  1    4    1           Fiat X1-9    cyl=4           16
 4: 30.4   4  75.7  52 4.93 1.615 18.52  1  1    4    2         Honda Civic    cyl=4           16
 5: 30.4   4  95.1 113 3.77 1.513 16.90  1  1    5    2        Lotus Europa    cyl=4           20
 6: 22.8   4 140.8  95 3.92 3.150 22.90  1  0    4    2            Merc 230    cyl=4           16
 7: 24.4   4 146.7  62 3.69 3.190 20.00  1  0    4    2           Merc 240D    cyl=4           16
 8: 26.0   4 120.3  91 4.43 2.140 16.70  0  1    5    2       Porsche 914-2    cyl=4           20
 9: 33.9   4  71.1  65 4.22 1.835 19.90  1  1    4    1      Toyota Corolla    cyl=4           16
10: 21.5   4 120.1  97 3.70 2.465 20.01  1  0    3    1       Toyota Corona    cyl=4           12
11: 21.4   4 121.0 109 4.11 2.780 18.60  1  1    4    2          Volvo 142E    cyl=4           16
12: 19.7   6 145.0 175 3.62 2.770 15.50  0  1    5    6        Ferrari Dino    cyl=6           30
13: 21.4   6 258.0 110 3.08 3.215 19.44  1  0    3    1      Hornet 4 Drive    cyl=6           18
14: 21.0   6 160.0 110 3.90 2.620 16.46  0  1    4    4           Mazda RX4    cyl=6           24
15: 21.0   6 160.0 110 3.90 2.875 17.02  0  1    4    4       Mazda RX4 Wag    cyl=6           24
16: 19.2   6 167.6 123 3.92 3.440 18.30  1  0    4    4            Merc 280    cyl=6           24
17: 17.8   6 167.6 123 3.92 3.440 18.90  1  0    4    4           Merc 280C    cyl=6           24
18: 18.1   6 225.0 105 2.76 3.460 20.22  1  0    3    1             Valiant    cyl=6           18
19: 15.2   8 304.0 150 3.15 3.435 17.30  0  0    3    2         AMC Javelin    cyl=8           24
20: 10.4   8 472.0 205 2.93 5.250 17.98  0  0    3    4  Cadillac Fleetwood    cyl=8           24
21: 13.3   8 350.0 245 3.73 3.840 15.41  0  0    3    4          Camaro Z28    cyl=8           24
22: 14.7   8 440.0 230 3.23 5.345 17.42  0  0    3    4   Chrysler Imperial    cyl=8           24
23: 15.5   8 318.0 150 2.76 3.520 16.87  0  0    3    2    Dodge Challenger    cyl=8           24
24: 14.3   8 360.0 245 3.21 3.570 15.84  0  0    3    4          Duster 360    cyl=8           24
25: 15.8   8 351.0 264 4.22 3.170 14.50  0  1    5    4      Ford Pantera L    cyl=8           40
26: 18.7   8 360.0 175 3.15 3.440 17.02  0  0    3    2   Hornet Sportabout    cyl=8           24
27: 10.4   8 460.0 215 3.00 5.424 17.82  0  0    3    4 Lincoln Continental    cyl=8           24
28: 15.0   8 301.0 335 3.54 3.570 14.60  0  1    5    8       Maserati Bora    cyl=8           40
29: 16.4   8 275.8 180 3.07 4.070 17.40  0  0    3    3          Merc 450SE    cyl=8           24
30: 17.3   8 275.8 180 3.07 3.730 17.60  0  0    3    3          Merc 450SL    cyl=8           24
31: 15.2   8 275.8 180 3.07 3.780 18.00  0  0    3    3         Merc 450SLC    cyl=8           24
32: 19.2   8 400.0 175 3.08 3.845 17.05  0  0    3    2    Pontiac Firebird    cyl=8           24
     mpg cyl  disp  hp drat    wt  qsec vs am gear carb               names cylNames cylTimesGear
</pre>
</div>
</div>
</div>

<div id="outline-container-org7d6b97f" class="outline-3">
<h3 id="org7d6b97f"><span class="section-number-3">7.4</span> List</h3>
<div class="outline-text-3" id="text-7-4">
<p>
When the second index is a list, then a new data.table will be returned instead of a simple vector. For example we can extract a new data.table with three
columns (two of which we rename)
</p>

<div class="org-src-container">
<pre class="src src-R">mtcarsDT[,list(cylinder=cyl, weight=wt, gear)]
</pre>
</div>

<div class="org-src-container">
<pre class="src src-text">    cylinder weight gear
 1:        4  2.320    4
 2:        4  2.200    4
 3:        4  1.935    4
 4:        4  1.615    4
 5:        4  1.513    5
 6:        4  3.150    4
 7:        4  3.190    4
 8:        4  2.140    5
 9:        4  1.835    4
10:        4  2.465    3
11:        4  2.780    4
12:        6  2.770    5
13:        6  3.215    3
14:        6  2.620    4
15:        6  2.875    4
16:        6  3.440    4
17:        6  3.440    4
18:        6  3.460    3
19:        8  3.435    3
20:        8  5.250    3
21:        8  3.840    3
22:        8  5.345    3
23:        8  3.520    3
24:        8  3.570    3
25:        8  3.170    5
26:        8  3.440    3
27:        8  5.424    3
28:        8  3.570    5
29:        8  4.070    3
30:        8  3.730    3
31:        8  3.780    3
32:        8  3.845    3
    cylinder weight gear
</pre>
</div>
</div>
</div>
