docs/dataTable.html

<div id="outline-container-org0066242" class="outline-3">
<h3 id="org0066242"><span class="section-number-3">7.5</span> Aggregation</h3>
<div class="outline-text-3" id="text-7-5">
<p>
That second expression can do more than transform columns into new columns; it aggregate things.  
</p>

<div class="org-src-container">
<pre class="src src-R">mtcarsDT[,sum(wt)]
</pre>
</div>

<div class="org-src-container">
<pre class="src src-text">[1] 102.952
</pre>
</div>

<p>
As before, if the second expression is a list we get a new data.table.  If the second expression computes aggregates, then we get more than one
aggregation. 
</p>

<div class="org-src-container">
<pre class="src src-R">mtcarsDT[,list(daSum=sum(wt), daSd=sd(wt))]
</pre>
</div>

<div class="org-src-container">
<pre class="src src-text">     daSum      daSd
1: 102.952 0.9784574
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orgdf3c624" class="outline-2">
<h2 id="orgdf3c624"><span class="section-number-2">8</span> Indexing: The third argument</h2>
<div class="outline-text-2" id="text-8">
</div>
<div id="outline-container-org42fe05f" class="outline-3">
<h3 id="org42fe05f"><span class="section-number-3">8.1</span> Aggregation by factors</h3>
<div class="outline-text-3" id="text-8-1">
<p>
The third argument is used to group data.
</p>

<div class="org-src-container">
<pre class="src src-R">mtcarsDT[,sum(wt),cyl]
</pre>
</div>

<div class="org-src-container">
<pre class="src src-text">   cyl     V1
1:   4 25.143
2:   6 21.820
3:   8 55.989
</pre>
</div>

<p>
The groups can contain more than one factor if we use a list.  We can also name the aggregate column if we put that in a list.
</p>

<div class="org-src-container">
<pre class="src src-R">mtcarsDT[,list(sumWt=sum(wt)),list(cyl, gear)]
</pre>
</div>

<div class="org-src-container">
<pre class="src src-text">   cyl gear  sumWt
1:   4    4 19.025
2:   4    5  3.653
3:   4    3  2.465
4:   6    5  2.770
5:   6    3  6.675
6:   6    4 12.375
7:   8    3 49.249
8:   8    5  6.740
</pre>
</div>
</div>
</div>

<div id="outline-container-orgd758a87" class="outline-3">
<h3 id="orgd758a87"><span class="section-number-3">8.2</span> Aggregation and new columns</h3>
<div class="outline-text-3" id="text-8-2">
<p>
We can aggregate by groups and put it back into the data.table!!
</p>

<div class="org-src-container">
<pre class="src src-R">mtcarsDT[,sumWtByCyl:=sum(wt),cyl]
mtcarsDT
</pre>
</div>

<div class="org-src-container">
<pre class="src src-text">     mpg cyl  disp  hp drat    wt  qsec vs am gear carb               names cylNames cylTimesGear sumWtByCyl
 1: 22.8   4 108.0  93 3.85 2.320 18.61  1  1    4    1          Datsun 710    cyl=4           16     25.143
 2: 32.4   4  78.7  66 4.08 2.200 19.47  1  1    4    1            Fiat 128    cyl=4           16     25.143
 3: 27.3   4  79.0  66 4.08 1.935 18.90  1  1    4    1           Fiat X1-9    cyl=4           16     25.143
 4: 30.4   4  75.7  52 4.93 1.615 18.52  1  1    4    2         Honda Civic    cyl=4           16     25.143
 5: 30.4   4  95.1 113 3.77 1.513 16.90  1  1    5    2        Lotus Europa    cyl=4           20     25.143
 6: 22.8   4 140.8  95 3.92 3.150 22.90  1  0    4    2            Merc 230    cyl=4           16     25.143
 7: 24.4   4 146.7  62 3.69 3.190 20.00  1  0    4    2           Merc 240D    cyl=4           16     25.143
 8: 26.0   4 120.3  91 4.43 2.140 16.70  0  1    5    2       Porsche 914-2    cyl=4           20     25.143
 9: 33.9   4  71.1  65 4.22 1.835 19.90  1  1    4    1      Toyota Corolla    cyl=4           16     25.143
10: 21.5   4 120.1  97 3.70 2.465 20.01  1  0    3    1       Toyota Corona    cyl=4           12     25.143
11: 21.4   4 121.0 109 4.11 2.780 18.60  1  1    4    2          Volvo 142E    cyl=4           16     25.143
12: 19.7   6 145.0 175 3.62 2.770 15.50  0  1    5    6        Ferrari Dino    cyl=6           30     21.820
13: 21.4   6 258.0 110 3.08 3.215 19.44  1  0    3    1      Hornet 4 Drive    cyl=6           18     21.820
14: 21.0   6 160.0 110 3.90 2.620 16.46  0  1    4    4           Mazda RX4    cyl=6           24     21.820
15: 21.0   6 160.0 110 3.90 2.875 17.02  0  1    4    4       Mazda RX4 Wag    cyl=6           24     21.820
16: 19.2   6 167.6 123 3.92 3.440 18.30  1  0    4    4            Merc 280    cyl=6           24     21.820
17: 17.8   6 167.6 123 3.92 3.440 18.90  1  0    4    4           Merc 280C    cyl=6           24     21.820
18: 18.1   6 225.0 105 2.76 3.460 20.22  1  0    3    1             Valiant    cyl=6           18     21.820
19: 15.2   8 304.0 150 3.15 3.435 17.30  0  0    3    2         AMC Javelin    cyl=8           24     55.989
20: 10.4   8 472.0 205 2.93 5.250 17.98  0  0    3    4  Cadillac Fleetwood    cyl=8           24     55.989
21: 13.3   8 350.0 245 3.73 3.840 15.41  0  0    3    4          Camaro Z28    cyl=8           24     55.989
22: 14.7   8 440.0 230 3.23 5.345 17.42  0  0    3    4   Chrysler Imperial    cyl=8           24     55.989
23: 15.5   8 318.0 150 2.76 3.520 16.87  0  0    3    2    Dodge Challenger    cyl=8           24     55.989
24: 14.3   8 360.0 245 3.21 3.570 15.84  0  0    3    4          Duster 360    cyl=8           24     55.989
25: 15.8   8 351.0 264 4.22 3.170 14.50  0  1    5    4      Ford Pantera L    cyl=8           40     55.989
26: 18.7   8 360.0 175 3.15 3.440 17.02  0  0    3    2   Hornet Sportabout    cyl=8           24     55.989
27: 10.4   8 460.0 215 3.00 5.424 17.82  0  0    3    4 Lincoln Continental    cyl=8           24     55.989
28: 15.0   8 301.0 335 3.54 3.570 14.60  0  1    5    8       Maserati Bora    cyl=8           40     55.989
29: 16.4   8 275.8 180 3.07 4.070 17.40  0  0    3    3          Merc 450SE    cyl=8           24     55.989
30: 17.3   8 275.8 180 3.07 3.730 17.60  0  0    3    3          Merc 450SL    cyl=8           24     55.989
31: 15.2   8 275.8 180 3.07 3.780 18.00  0  0    3    3         Merc 450SLC    cyl=8           24     55.989
32: 19.2   8 400.0 175 3.08 3.845 17.05  0  0    3    2    Pontiac Firebird    cyl=8           24     55.989
     mpg cyl  disp  hp drat    wt  qsec vs am gear carb               names cylNames cylTimesGear sumWtByCyl
</pre>
</div>
</div>
</div>
</div>
