src/dataTable.org
* Joining

Merge is much like with data.frames.  One nice feature is that key columns will be used for a merge automatically if they are set.

#+BEGIN_SRC R :session :results output verbatim :exports both :tangle "../tangled/dataTable.R" :wrap "src text :eval never :tangle no"
crbn <- data.table(carb=c(1,2,3), carbs=c("one", "two", "three"))
setkey(mtcarsDT, carb)
setkey(crbn, carb)
merge(mtcarsDT, crbn, all.x=TRUE)
#+END_SRC

#+RESULTS:
#+begin_src text :eval never :tangle no
    carb  mpg cyl  disp  hp drat    wt  qsec vs am gear               names cylNames cylTimesGear sumWtByCyl carbs
 1:    1 22.8   4 108.0  93 3.85 2.320 18.61  1  1    4          Datsun 710    cyl=4           16     25.143   one
 2:    1 32.4   4  78.7  66 4.08 2.200 19.47  1  1    4            Fiat 128    cyl=4           16     25.143   one
 3:    1 27.3   4  79.0  66 4.08 1.935 18.90  1  1    4           Fiat X1-9    cyl=4           16     25.143   one
 4:    1 33.9   4  71.1  65 4.22 1.835 19.90  1  1    4      Toyota Corolla    cyl=4           16     25.143   one
 5:    1 21.5   4 120.1  97 3.70 2.465 20.01  1  0    3       Toyota Corona    cyl=4           12     25.143   one
 6:    1 21.4   6 258.0 110 3.08 3.215 19.44  1  0    3      Hornet 4 Drive    cyl=6           18     21.820   one
 7:    1 18.1   6 225.0 105 2.76 3.460 20.22  1  0    3             Valiant    cyl=6           18     21.820   one
 8:    2 30.4   4  75.7  52 4.93 1.615 18.52  1  1    4         Honda Civic    cyl=4           16     25.143   two
 9:    2 30.4   4  95.1 113 3.77 1.513 16.90  1  1    5        Lotus Europa    cyl=4           20     25.143   two
10:    2 22.8   4 140.8  95 3.92 3.150 22.90  1  0    4            Merc 230    cyl=4           16     25.143   two
11:    2 24.4   4 146.7  62 3.69 3.190 20.00  1  0    4           Merc 240D    cyl=4           16     25.143   two
12:    2 26.0   4 120.3  91 4.43 2.140 16.70  0  1    5       Porsche 914-2    cyl=4           20     25.143   two
13:    2 21.4   4 121.0 109 4.11 2.780 18.60  1  1    4          Volvo 142E    cyl=4           16     25.143   two
14:    2 15.2   8 304.0 150 3.15 3.435 17.30  0  0    3         AMC Javelin    cyl=8           24     55.989   two
15:    2 15.5   8 318.0 150 2.76 3.520 16.87  0  0    3    Dodge Challenger    cyl=8           24     55.989   two
16:    2 18.7   8 360.0 175 3.15 3.440 17.02  0  0    3   Hornet Sportabout    cyl=8           24     55.989   two
17:    2 19.2   8 400.0 175 3.08 3.845 17.05  0  0    3    Pontiac Firebird    cyl=8           24     55.989   two
18:    3 16.4   8 275.8 180 3.07 4.070 17.40  0  0    3          Merc 450SE    cyl=8           24     55.989 three
19:    3 17.3   8 275.8 180 3.07 3.730 17.60  0  0    3          Merc 450SL    cyl=8           24     55.989 three
20:    3 15.2   8 275.8 180 3.07 3.780 18.00  0  0    3         Merc 450SLC    cyl=8           24     55.989 three
21:    4 21.0   6 160.0 110 3.90 2.620 16.46  0  1    4           Mazda RX4    cyl=6           24     21.820  <NA>
22:    4 21.0   6 160.0 110 3.90 2.875 17.02  0  1    4       Mazda RX4 Wag    cyl=6           24     21.820  <NA>
23:    4 19.2   6 167.6 123 3.92 3.440 18.30  1  0    4            Merc 280    cyl=6           24     21.820  <NA>
24:    4 17.8   6 167.6 123 3.92 3.440 18.90  1  0    4           Merc 280C    cyl=6           24     21.820  <NA>
25:    4 10.4   8 472.0 205 2.93 5.250 17.98  0  0    3  Cadillac Fleetwood    cyl=8           24     55.989  <NA>
26:    4 13.3   8 350.0 245 3.73 3.840 15.41  0  0    3          Camaro Z28    cyl=8           24     55.989  <NA>
27:    4 14.7   8 440.0 230 3.23 5.345 17.42  0  0    3   Chrysler Imperial    cyl=8           24     55.989  <NA>
28:    4 14.3   8 360.0 245 3.21 3.570 15.84  0  0    3          Duster 360    cyl=8           24     55.989  <NA>
29:    4 15.8   8 351.0 264 4.22 3.170 14.50  0  1    5      Ford Pantera L    cyl=8           40     55.989  <NA>
30:    4 10.4   8 460.0 215 3.00 5.424 17.82  0  0    3 Lincoln Continental    cyl=8           24     55.989  <NA>
31:    6 19.7   6 145.0 175 3.62 2.770 15.50  0  1    5        Ferrari Dino    cyl=6           30     21.820  <NA>
32:    8 15.0   8 301.0 335 3.54 3.570 14.60  0  1    5       Maserati Bora    cyl=8           40     55.989  <NA>
    carb  mpg cyl  disp  hp drat    wt  qsec vs am gear               names cylNames cylTimesGear sumWtByCyl carbs
#+end_src

* Reading data from the outside world

** Read a CSV or TSV file

Note this is *much* faster than =read.csv= and =read.table=.

#+BEGIN_SRC R :session :results output verbatim :exports both :tangle "../tangled/dataTable.R" :wrap "src text :eval never :tangle no"
df1 <- fread("../data/dataTable_f1.csv")
df1
#+END_SRC

#+RESULTS:
#+begin_src text :eval never :tangle no
     name age weight
1:  babar  25    900
2: grumpy   2      3
#+end_src

** Compressed files are decompressed automatically

#+BEGIN_SRC R :session :results output verbatim :exports both :tangle "../tangled/dataTable.R" :wrap "src text :eval never :tangle no"
df2 <- fread("../data/dataTable_f2.csv.gz")
df2
#+END_SRC

#+RESULTS:
#+begin_src text :eval never :tangle no
     name age weight
1:   kong  12    700
2: george   7     15
#+end_src

** Reading data from a URL

#+BEGIN_SRC R :session :results output verbatim :exports both :tangle "../tangled/dataTable.R" :wrap "src text :eval never :tangle no"
df1u <- fread('https://github.com/richmit/ex-R/raw/master/data/dataTable_f2.csv.gz')
df1u
#+END_SRC

#+RESULTS:
#+begin_src text :eval never :tangle no
     name age weight
1:   kong  12    700
2: george   7     15
#+end_src

** Read output from a command (in this case compressing with gunzip and filtering with awk)

#+BEGIN_SRC R :session :results output verbatim :exports both :tangle "../tangled/dataTable.R" :wrap "src text :eval never :tangle no"
df2 <- fread("gunzip < ../data/dataTable_f2.csv.gz | awk -F, 'NR==1 || $3<100 { print $0 }'")
df2
#+END_SRC

#+RESULTS:
#+begin_src text :eval never :tangle no
Empty data.table (0 rows and 3 cols): name,age,weight
#+end_src

** Read a colon (:) separated file with extra whitespace and no column names

#+BEGIN_SRC R :session :results output verbatim :exports both :tangle "../tangled/dataTable.R" :wrap "src text :eval never :tangle no"
df3 <- fread('dataTable_f3.txt', sep=':', header=FALSE, strip.white=TRUE, col.names=c('name', 'age', 'weight'))
df3
#+END_SRC

#+RESULTS:
#+begin_src text :eval never :tangle no
Error in fread("dataTable_f3.txt", sep = ":", header = FALSE, strip.white = TRUE,  : 
  File 'dataTable_f3.txt' does not exist or is non-readable. getwd()=='c:/Users/richmit/Documents/world/my_prog/learn/R/src'
Error: object 'df3' not found
#+end_src

