docs/dataTable.html

<div id="outline-container-org8020187" class="outline-2">
<h2 id="org8020187"><span class="section-number-2">9</span> Joining</h2>
<div class="outline-text-2" id="text-9">
<p>
Merge is much like with data.frames.  One nice feature is that key columns will be used for a merge automatically if they are set.
</p>

<div class="org-src-container">
<pre class="src src-R">crbn <span style="color: #8470ff; font-weight: bold;">&lt;-</span> data.table(carb=c(1,2,3), carbs=c(<span style="color: #fa8072;">"one"</span>, <span style="color: #fa8072;">"two"</span>, <span style="color: #fa8072;">"three"</span>))
setkey(mtcarsDT, carb)
setkey(crbn, carb)
merge(mtcarsDT, crbn, all.x=<span style="color: #63b8ff;">TRUE</span>)
</pre>
</div>

<div class="org-src-container">
<pre class="src src-text">    carb  mpg cyl  disp  hp drat    wt  qsec vs am gear               names cylNames cylTimesGear sumWtByCyl carbs
 1:    1 22.8   4 108.0  93 3.85 2.320 18.61  1  1    4          Datsun 710    cyl=4           16     25.143   one
 2:    1 32.4   4  78.7  66 4.08 2.200 19.47  1  1    4            Fiat 128    cyl=4           16     25.143   one
 3:    1 27.3   4  79.0  66 4.08 1.935 18.90  1  1    4           Fiat X1-9    cyl=4           16     25.143   one
 4:    1 33.9   4  71.1  65 4.22 1.835 19.90  1  1    4      Toyota Corolla    cyl=4           16     25.143   one
 5:    1 21.5   4 120.1  97 3.70 2.465 20.01  1  0    3       Toyota Corona    cyl=4           12     25.143   one
 6:    1 21.4   6 258.0 110 3.08 3.215 19.44  1  0    3      Hornet 4 Drive    cyl=6           18     21.820   one
 7:    1 18.1   6 225.0 105 2.76 3.460 20.22  1  0    3             Valiant    cyl=6           18     21.820   one
 8:    2 30.4   4  75.7  52 4.93 1.615 18.52  1  1    4         Honda Civic    cyl=4           16     25.143   two
 9:    2 30.4   4  95.1 113 3.77 1.513 16.90  1  1    5        Lotus Europa    cyl=4           20     25.143   two
10:    2 22.8   4 140.8  95 3.92 3.150 22.90  1  0    4            Merc 230    cyl=4           16     25.143   two
11:    2 24.4   4 146.7  62 3.69 3.190 20.00  1  0    4           Merc 240D    cyl=4           16     25.143   two
12:    2 26.0   4 120.3  91 4.43 2.140 16.70  0  1    5       Porsche 914-2    cyl=4           20     25.143   two
13:    2 21.4   4 121.0 109 4.11 2.780 18.60  1  1    4          Volvo 142E    cyl=4           16     25.143   two
14:    2 15.2   8 304.0 150 3.15 3.435 17.30  0  0    3         AMC Javelin    cyl=8           24     55.989   two
15:    2 15.5   8 318.0 150 2.76 3.520 16.87  0  0    3    Dodge Challenger    cyl=8           24     55.989   two
16:    2 18.7   8 360.0 175 3.15 3.440 17.02  0  0    3   Hornet Sportabout    cyl=8           24     55.989   two
17:    2 19.2   8 400.0 175 3.08 3.845 17.05  0  0    3    Pontiac Firebird    cyl=8           24     55.989   two
18:    3 16.4   8 275.8 180 3.07 4.070 17.40  0  0    3          Merc 450SE    cyl=8           24     55.989 three
19:    3 17.3   8 275.8 180 3.07 3.730 17.60  0  0    3          Merc 450SL    cyl=8           24     55.989 three
20:    3 15.2   8 275.8 180 3.07 3.780 18.00  0  0    3         Merc 450SLC    cyl=8           24     55.989 three
21:    4 21.0   6 160.0 110 3.90 2.620 16.46  0  1    4           Mazda RX4    cyl=6           24     21.820  &lt;NA&gt;
22:    4 21.0   6 160.0 110 3.90 2.875 17.02  0  1    4       Mazda RX4 Wag    cyl=6           24     21.820  &lt;NA&gt;
23:    4 19.2   6 167.6 123 3.92 3.440 18.30  1  0    4            Merc 280    cyl=6           24     21.820  &lt;NA&gt;
24:    4 17.8   6 167.6 123 3.92 3.440 18.90  1  0    4           Merc 280C    cyl=6           24     21.820  &lt;NA&gt;
25:    4 10.4   8 472.0 205 2.93 5.250 17.98  0  0    3  Cadillac Fleetwood    cyl=8           24     55.989  &lt;NA&gt;
26:    4 13.3   8 350.0 245 3.73 3.840 15.41  0  0    3          Camaro Z28    cyl=8           24     55.989  &lt;NA&gt;
27:    4 14.7   8 440.0 230 3.23 5.345 17.42  0  0    3   Chrysler Imperial    cyl=8           24     55.989  &lt;NA&gt;
28:    4 14.3   8 360.0 245 3.21 3.570 15.84  0  0    3          Duster 360    cyl=8           24     55.989  &lt;NA&gt;
29:    4 15.8   8 351.0 264 4.22 3.170 14.50  0  1    5      Ford Pantera L    cyl=8           40     55.989  &lt;NA&gt;
30:    4 10.4   8 460.0 215 3.00 5.424 17.82  0  0    3 Lincoln Continental    cyl=8           24     55.989  &lt;NA&gt;
31:    6 19.7   6 145.0 175 3.62 2.770 15.50  0  1    5        Ferrari Dino    cyl=6           30     21.820  &lt;NA&gt;
32:    8 15.0   8 301.0 335 3.54 3.570 14.60  0  1    5       Maserati Bora    cyl=8           40     55.989  &lt;NA&gt;
    carb  mpg cyl  disp  hp drat    wt  qsec vs am gear               names cylNames cylTimesGear sumWtByCyl carbs
</pre>
</div>
</div>
</div>

<div id="outline-container-org1ad6570" class="outline-2">
<h2 id="org1ad6570"><span class="section-number-2">10</span> Reading data from the outside world</h2>
<div class="outline-text-2" id="text-10">
</div>
<div id="outline-container-orgb2e92fb" class="outline-3">
<h3 id="orgb2e92fb"><span class="section-number-3">10.1</span> Read a CSV or TSV file</h3>
<div class="outline-text-3" id="text-10-1">
<p>
Note this is <b>much</b> faster than <code>read.csv</code> and <code>read.table</code>.
</p>

<div class="org-src-container">
<pre class="src src-R">df1 <span style="color: #8470ff; font-weight: bold;">&lt;-</span> fread(<span style="color: #fa8072;">"../data/dataTable_f1.csv"</span>)
df1
</pre>
</div>

<div class="org-src-container">
<pre class="src src-text">     name age weight
1:  babar  25    900
2: grumpy   2      3
</pre>
</div>
</div>
</div>

<div id="outline-container-org0874952" class="outline-3">
<h3 id="org0874952"><span class="section-number-3">10.2</span> Compressed files are decompressed automatically</h3>
<div class="outline-text-3" id="text-10-2">
<div class="org-src-container">
<pre class="src src-R">df2 <span style="color: #8470ff; font-weight: bold;">&lt;-</span> fread(<span style="color: #fa8072;">"../data/dataTable_f2.csv.gz"</span>)
df2
</pre>
</div>

<div class="org-src-container">
<pre class="src src-text">     name age weight
1:   kong  12    700
2: george   7     15
</pre>
</div>
</div>
</div>

<div id="outline-container-orgfc90502" class="outline-3">
<h3 id="orgfc90502"><span class="section-number-3">10.3</span> Reading data from a URL</h3>
<div class="outline-text-3" id="text-10-3">
<div class="org-src-container">
<pre class="src src-R">df1u <span style="color: #8470ff; font-weight: bold;">&lt;-</span> fread(<span style="color: #fa8072;">'https://github.com/richmit/ex-R/raw/master/data/dataTable_f2.csv.gz'</span>)
df1u
</pre>
</div>

<div class="org-src-container">
<pre class="src src-text">     name age weight
1:   kong  12    700
2: george   7     15
</pre>
</div>
</div>
</div>

<div id="outline-container-org69f0fef" class="outline-3">
<h3 id="org69f0fef"><span class="section-number-3">10.4</span> Read output from a command (in this case compressing with gunzip and filtering with awk)</h3>
<div class="outline-text-3" id="text-10-4">
<div class="org-src-container">
<pre class="src src-R">df2 <span style="color: #8470ff; font-weight: bold;">&lt;-</span> fread(<span style="color: #fa8072;">"gunzip &lt; ../data/dataTable_f2.csv.gz | awk -F, 'NR==1 || $3&lt;100 { print $0 }'"</span>)
df2
</pre>
</div>

<div class="org-src-container">
<pre class="src src-text">Empty data.table (0 rows and 3 cols): name,age,weight
</pre>
</div>
</div>
</div>

<div id="outline-container-org9da1994" class="outline-3">
<h3 id="org9da1994"><span class="section-number-3">10.5</span> Read a colon (:) separated file with extra whitespace and no column names</h3>
<div class="outline-text-3" id="text-10-5">
<div class="org-src-container">
<pre class="src src-R">df3 <span style="color: #8470ff; font-weight: bold;">&lt;-</span> fread(<span style="color: #fa8072;">'dataTable_f3.txt'</span>, sep=<span style="color: #fa8072;">':'</span>, header=<span style="color: #63b8ff;">FALSE</span>, strip.white=<span style="color: #63b8ff;">TRUE</span>, col.names=c(<span style="color: #fa8072;">'name'</span>, <span style="color: #fa8072;">'age'</span>, <span style="color: #fa8072;">'weight'</span>))
df3
</pre>
</div>

<div class="org-src-container">
<pre class="src src-text">Error in fread("dataTable_f3.txt", sep = ":", header = FALSE, strip.white = TRUE,  : 
  File 'dataTable_f3.txt' does not exist or is non-readable. getwd()=='c:/Users/richmit/Documents/world/my_prog/learn/R/src'
Error: object 'df3' not found
</pre>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
Created by Mitch Richling <<a href="mailto:http://www.mitchr.me/">http://www.mitchr.me/</a>>.  Rendered on 2021-05-04 Tue 18:35 via <a href="https://www.gnu.org/software/emacs/">Emacs</a> 27.1 (<a href="https://orgmode.org">Org</a> mode 9.4.5)
</div>
</body>
</html>
